In [5]:
data = {"State": ["Santa Catarina", "Rio de Janeiro", "Tocatins", "Bahia", "Minas Gerais"],
        "Year": [2004,2005,2006,2007,2008],
        "Unemployment Rate": [1.5, 1.7, 1.6, 2.4, 2.7]}

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(data)

In [8]:
df.head()

            State  Year  Unemployment Rate
0  Santa Catarina  2004                1.5
1  Rio de Janeiro  2005                1.7
2        Tocatins  2006                1.6
3           Bahia  2007                2.4
4    Minas Gerais  2008                2.7

In [9]:
pd.DataFrame(data, columns=["State", "Unemployment Rate", "Year"])

            State  Unemployment Rate  Year
0  Santa Catarina                1.5  2004
1  Rio de Janeiro                1.7  2005
2        Tocatins                1.6  2006
3           Bahia                2.4  2007
4    Minas Gerais                2.7  2008

In [10]:
df2 = pd.DataFrame(data,
                   columns=["State", "Unemployment Rate", "Growth Rate", "Year"],
                   index = ["state1", "state2", "state3", "state4", "state5"])

In [11]:
df2

                 State  Unemployment Rate Growth Rate  Year
state1  Santa Catarina                1.5         NaN  2004
state2  Rio de Janeiro                1.7         NaN  2005
state3        Tocatins                1.6         NaN  2006
state4           Bahia                2.4         NaN  2007
state5    Minas Gerais                2.7         NaN  2008

In [12]:
df2.columns

Index(['State', 'Unemployment Rate', 'Growth Rate', 'Year'], dtype='object')